arr = [621, 445, 147, 159, 430, 222, 482, 44, 194, 522, 652, 494, 14, 126, 532, 387, 441, 471, 337, 
        446, 18, 36, 202, 574, 556, 458, 16, 139, 222, 220, 107, 82, 264, 366, 501, 319, 314, 430, 55, 336]

p "– дізнатись кількість елементів в масиві;"
    p arr.size

p "– перевернути масив;"
    p arr.reverse

p "– знайти найбільше число;"
    p arr.max

p "– знайти найменше число;"
    p arr.min

p "– відсортувати від меншого до більшого;"
    p arr.sort
    
p "– відсортувати від більшого до меншого;"
    p arr.sort.reverse

p "– видалити всі непарні числа;"
    p arr.select{|a| a.even? }
    
p "– залишити тільки ті числа, які без остачі ділятся на 3;"
    p arr.select{|a| a % 3 == 0}

p "– видалити з масиву числа, які повторюються (тобто, потрібно вивести масив, в якому немає повторень);"
    p arr.uniq

p "– розділити кожен елемент на 10, в результаті елементи не мають бути округленими до цілого;"
    p arr.each{ |a| a.to_f / 10 }

p "– отримати новий масив, який би містив в собі ті літери англійського алфавіту, порядковий номер яких є в нашому масиві;"
p "– змінити місцями мінімальний і максимальний елементи масиву;"
p "– знайти елементи, які знаходяться перед мінімальним числом в масиві;"
    p arr.index(arr.min)

p "– необхідно знайти три найменших елементи."
    p arr.min(3)